<template><div><ol start="2">
<li>机器学习的训练过程的核心就是通过调整模型的参数，使得预测值与真实值之间的差距（即代价函数的值）最小化。而具体的优化过程通常是通过 <strong>梯度下降</strong> 等方法完成的</li>
<li>通过确定参数,然后根据特定参数给出的预测值与真实值的平方差和来确定是不是合适的参数</li>
<li><img src="/img/user/附件/Pasted image 20241225190332.png" alt="Pasted image 20241225190332.png"></li>
<li>代价函数优化的核心：为什么是梯度
优化过程是<strong>寻找代价函数的最小值</strong>，而梯度在这个过程中起到了关键作用。
<strong>什么是梯度？</strong></li>
</ol>
<p>• 梯度是指函数的偏导数，表示函数在某一点处的变化率或斜率。</p>
<p>• 在多维空间中，梯度是一个向量，指向函数增长最快的方向。</p>
<p><strong>为什么用梯度优化参数？</strong></p>
<p>• <strong>梯度指引方向</strong>：</p>
<p>• 梯度指出了代价函数增大的方向。如果我们希望减小代价函数值，只需要朝梯度的<strong>反方向</strong>移动。</p>
<p>• 换句话说，梯度下降法是一种从高处“下坡”的方法，沿着坡度最陡的方向下降，直到找到最低点（全局最小值或局部最小值）。</p>
</div></template>


