<template><div><ul>
<li>
<p>11:19
#随想 突然想到要学习好多内容,但是时间所剩无几了,机器学习,cpp,go.... 先把书看好吧,耐下性子来好吗</p>
</li>
<li>
<p>12:40
#随想 找到了学习的一个小目标,写一个mit的xv6操作系统 任重而道远哇</p>
</li>
<li>
<p>12:49
#随想 找到了奋斗的方向,斯坦福的ml course看完,然后就是辅助一些书籍,像是西瓜书和实战 加油</p>
</li>
<li>
<p>12:58 #随想 突然想到了每次配置环境的时候都会或多或少的出现一点差错,我仔细想了想,从根本来说我不知道cpp是如何在底层运行的,只是知道书本上的知识,我不知道python的虚拟环境,conda是怎么运行的,我也不知道python的解释器是干什么的,这么一想就感觉自己基础还是很薄弱的</p>
</li>
<li>
<p>13:44 #学习 机器学习的资料是真的多啊,但是这个作为基础一定是要好好学习的</p>
</li>
<li>
<p>23:10
#任务 git的二十页笔记</p>
</li>
<li>
<p>23:10 #任务 机器学习两章</p>
</li>
<li>
<p>23:11 #任务 力扣刷完数组这一章</p>
</li>
<li>
<p>23:11 #任务 cpp要看os的第一章节并做笔记</p>
</li>
</ul>
</div></template>


